#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eb2779a8-08c8-4182-a33d-0b08d2f8e9ff]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ab73ce-2e68-4ee8-8e7f-1eaf0062dcca]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=de31cad2-c65a-4c3f-b579-da9c8f6fc7e5]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ccd59005-c1fb-4121-955f-e9e46707277f]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6aed8c99-aa6d-4339-9c0e-a2026b0104ee]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bc1747b2-0d08-4dc7-9b9e-bd3fe294e5ea]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6437efc7-6192-475a-97ed-c3f7666a52ad]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b86c91d1-80e9-498f-b29c-06ee4af92cc2]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=328dc19a-7332-467a-ab99-3dcb040fe441]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=09c5e9bb-6c86-4819-b3c5-31f4b544ec20]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d270424c-8164-4084-978a-d77cc022deaa]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c70269fe-eb76-4005-bed5-d0fbad5ca09b]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=71a51674-2976-4b11-865a-3bec3dcbd60c]
module.keycloak_dev.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=626987d9-4b25-4f93-9d72-36bb9a20e16e]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7b986330-1804-4220-8bd6-6c9309a745c0]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=06421540-fd9b-4b88-989c-e4b2983deb62]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20145990-6a3b-48d5-8c99-99733194dee5]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=be9b51f2-361e-4db9-bbab-c2d542a043f5]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3378987d-b723-4617-beec-77a81337de78]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=80e8d9cb-ee2e-4d47-8afd-a33691744f9b]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c410a701-d3c9-424a-b6a8-2c1bf9c5f64e]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=409f4a4c-b512-4de6-9b6f-f1da6e36b147]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3f4e7a27-44f9-4108-87c0-4062bb107c38]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ee40dce-26eb-4e2f-9e6c-f62a93b551d0]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c86dff16-eaa8-40b7-a90d-4eca47a68f48]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4361a63-3caa-4f6c-ace3-919d449fa6ff]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=fa150b72-fdfc-4126-b025-04e9d0965993]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bceae56a-b19f-4a07-a85e-bde7987b75d1]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=71705fd2-5939-467f-9e46-601192a04fb8]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d0511de3-2abf-4a75-a182-5f0659fc03f7]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76c2b784-3a1f-402f-8443-979ad265f81a]
module.keycloak_dev.module.onestopauth.module.client_test-09-23-2147.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5229e226-2e5a-4c1b-b65c-3b68df4557b2]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f8966d6a-b47d-412b-b729-f8354024f4f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60fb2f48-1710-4f6d-84fa-e3de325969fa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d27dd485-3b8c-42e5-bc7d-6e0e3922e427]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aded100c-b585-4576-885e-762c67507c2f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=736f1be5-f20d-4b6e-b5b1-502a9fddc306]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02d2a3f3-1080-43ca-bcb0-0cde8b3b3174]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d880126e-28c8-4c16-912c-e477744a7777]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=958158a6-eb69-4efd-b102-80265d62e24a]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cafb241-d313-4358-82e6-d869c4709766]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0055cedc-4a82-4b56-91a0-ee9c2a32bd3c]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8025e9f6-2fe6-4037-b4f0-584658f1e2f7]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=234f7f2d-0968-4059-82ed-099e0dd2e3fe]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8220213-5d69-45ec-ab15-e1070dbf1305]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d3e82ce3-1763-4668-9148-27140d4b6494]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f98c02aa-f7f3-40fa-a161-ccabeb75dedd]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ae6c314c-6100-427a-ac52-e8bfaa1fd6f3]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2e698e3d-dd75-4564-ab54-a7aaff8cb959]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2885a23f-89c1-45fa-8918-291779c6a647]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a07eae3d-9aab-4fee-86d0-17356abe4114]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=657c788a-03b0-4523-8829-a66deb290123]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2f112e1e-daa4-4f9a-b0eb-ee3ad6e335fa]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c7a0eaa-308f-4e2b-848b-00f281813093]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f52b6cb2-d69e-43f3-8cc3-7f9a049333e3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a9db200b-c76e-4dd3-9cd4-7d34ba1f7e80]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=03e13cb9-52e0-4bd2-8b86-847e6947bf6b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1d9188d3-1408-4386-90f9-7ca99fd0fc60]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1dbd9344-e118-45b1-91ed-b16360fe9535]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7170c449-88ef-4c45-9f3e-6ccf16e93c54]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=60a1fe6a-97a5-4a9a-9fe8-733ac5bdc9d6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=67b3cf35-0760-4f05-aa1c-d56aca9505c5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8d452fa7-874f-4874-919d-c7f5c4677bbb]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=629191ee-5075-40ff-8759-f0d1d93e2328]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=48ba507a-0040-4ec1-9f8c-e5aed5badaa1]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d610bd0d-e2f4-48a1-a845-29ea1044e92f]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=94ba6ecc-9e74-43e5-a58e-ac42d065c323]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4981d55d-838b-4ecd-b384-30ac545834c6]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9330ccbf-6370-4deb-a0b1-22be8bda51a1]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=944eb2bd-7f31-400b-b097-b0f6ff9b52eb]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=91bf5fb9-2a56-4685-9c95-2c4cd198c86a]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=38466cb0-2eca-4ac7-aad5-1977f101f632]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8087163b-f90b-4166-a353-bc966dbb6bad]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=812c929b-2a36-4515-8347-23b3b02485c3]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a849cfea-06c5-4c7a-96d4-b129ed4ef14f]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fbb0aa2d-e4bb-4df0-8970-77c44a506b46]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8cb60968-cbaa-4622-b21f-8d3e4f739b86]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=682c10c9-f4d3-4278-84ea-66c919fa4de2]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c8cd887-f06a-411f-bec9-039161e03970]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b2e17562-bd7d-46c5-aeb8-0a82e0877d69]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=84fa455c-a0c2-49c2-98cc-cc6019924e29]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b538541-8333-4137-8772-0ee9787f7ccd]
module.keycloak_dev.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a2f0190b-9086-4de7-942f-74117c4ca240]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0e400b0-4f4d-4fad-860a-43935d8d0979]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=06daef36-41a0-4ce2-968e-033e36155df9]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=072fb673-8c17-4cff-8b56-674abde71b9f]
module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7008addb-f56e-43ad-9d1c-c95860caf91e]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0ef0c67a-a3c8-43ee-b063-94aee9369cfb]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e28c54bd-bc2c-45e8-8989-ce583c6cc4c9]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff3a9ce1-8b55-4d29-a4d7-4f5060983d20]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e01476-5a7e-4cb4-8be0-dc8d72a632e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=611eb206-5f42-444d-99f8-0e67d30e66e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f79608b6-c48a-4aef-8034-89d768bc481e]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d51f3680-5a56-42fa-ab7a-1ce46dd41233]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=55535ce7-35e1-41ed-a676-c4bd95901b73]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-b-ce-id-dev-test-5182"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-5182"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "tians-testing-b-ce-id-dev-test-5182"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-5182"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://exampleddddd",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-b-ce-id-dev-test-5182"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-5182"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "tians-testing-b-ce-id-dev-test-5182"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-5182"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3519 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*